import { SubjectCategory, UniqueId } from "../shared-kernel";


export interface Subject {
  id: UniqueId;
  subjectCategory: SubjectCategory
  name: string;
}



/*
 *	1. Як будемо розділяти їх по типам(Профільні, Загальні) ?
 *
 *  2. Отримувати предмети по группах норм ідея, але що якщо наш студент в різних группах ???
 *  в принципі якщо на кожну группу - нова пошта УКД, то group_id буде одним, у випадку
 *  якщо це все ж таки буде одна пошта, то в нас вже буде масив з groupId
 *
 *  3. Для мене зручно, коли я просто відправляю id студента та отримую всі предмети на нього
 */